#### IFCExtrusionCalculatorUtils Members

---

|  |
| --- |
| IFCExtrusionCalculatorUtils Class   Methods   See Also |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CalculateExtrusionData(IFCExtrusionCalculatorOptions, GeometryObject) | Calculates the extrusion data from a Revit geometry object. |
| Public method Static member | CalculateExtrusionData(IFCExtrusionCalculatorOptions, IList Face ) |  |

# See Also

IFCExtrusionCalculatorUtils Class

Autodesk.Revit.DB.IFC Namespace